
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       60 |          14 |           30 |
## Affected resources by action

|  Action  | Resources                                                                                                      |
|:--------:|:---------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_event_rule.run_every`                              |
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_event_target.lambda_target`                        |
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_log_group.lambda`                                  |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_policy.lambda_logging`                                    |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions`                                |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role.iam_for_lambda`                                      |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`       |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_logs`                       |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions`                |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_function.lambda`                                       |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_function_event_invoke_config.update_filter`            |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_permission.allow_eventbridge`                          |
|    🟢    | `module.actions-runner.module.deregistration.aws_s3_object.lambda_package`                                     |
|    🟢    | `module.actions-runner.module.deregistration.null_resource.install_python_dependencies`                        |
|    🟢    | `module.actions-runner.module.deregistration.random_uuid.lamda_src_hash`                                       |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_rule.run_every`                        |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_target.lambda_target`                  |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_log_group.lambda`                            |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_logging`                              |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_permissions`                          |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role.iam_for_lambda`                                |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole` |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_logs`                 |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions`          |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda`                                 |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_function_event_invoke_config.update_filter`      |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_eventbridge`                    |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package`                               |
|    🟢    | `module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies`                  |
|    🟢    | `module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash`                                 |
|    🟡    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low`                                           |
|    🟡    | `module.actions-runner.aws_iam_policy.required`                                                                |
|    🟡    | `module.actions-runner.aws_launch_template.actions-runner`                                                     |
|    🟡    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low`                                     |
|    🟡    | `module.actions-runner-noble.aws_iam_policy.required`                                                          |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                               |
|    🟡    | `module.actions-runner.module.instance-profile.aws_iam_policy.profile`                                         |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`                                        |
|    🟡    | `module.actions-runner.module.registration.aws_iam_policy.lambda_permissions`                                  |
|    🟡    | `module.actions-runner.module.registration.aws_lambda_function.main`                                           |
|    🟡    | `module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile`                                   |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`                                  |
|    🟡    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions`                            |
|    🟡    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`                                     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner must be replaced
-/+ resource "aws_autoscaling_group" "actions-runner" {
      ~ arn                              = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU" -> (known after apply)
      ~ availability_zones               = [
          - "us-west-1b",
          - "us-west-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 1 -> (known after apply)
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "actions-runner-2024122120350701390000000c-9wY7dU" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
        name                             = "actions-runner-2024122120350701390000000c-9wY7dU"
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::303467602807:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ availability_zone_distribution (known after apply)
      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      - initial_lifecycle_hook { # forces replacement
          - default_result          = "ABANDON" -> null
          - heartbeat_timeout       = 300 -> null
          - lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING" -> null
          - name                    = "launching" -> null
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook { # forces replacement
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "registration"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook { # forces replacement
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 3600
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "bootstrap"
            # (3 unchanged attributes hidden)
        }

      ~ instance_refresh {
          - triggers = [] -> null
            # (1 unchanged attribute hidden)

          ~ preferences {
              - auto_rollback                = false -> null
              - checkpoint_percentages       = [] -> null
                # (7 unchanged attributes hidden)
            }
        }

      ~ launch_template (known after apply)

      ~ mixed_instances_policy {
          ~ instances_distribution {
              ~ on_demand_allocation_strategy            = "prioritized" -> (known after apply)
              ~ spot_allocation_strategy                 = "lowest-price" -> (known after apply)
              ~ spot_instance_pools                      = 2 -> (known after apply)
                # (3 unchanged attributes hidden)
            }
          ~ launch_template {
              ~ launch_template_specification {
                  ~ launch_template_name = "actions-runner-2024122120350701390000000c" -> (known after apply)
                  ~ version              = "12" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
              ~ override (known after apply)
            }
        }

      ~ traffic_source (known after apply)

      + warm_pool {
          + max_group_prepared_capacity = 2
          + min_size                    = 2
          + pool_state                  = "Hibernated"

          + instance_reuse_policy {
              + reuse_on_scale_in = true
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_lifecycle_hook.terminating must be replaced
-/+ resource "aws_autoscaling_lifecycle_hook" "terminating" {
      ~ heartbeat_timeout       = 300 -> 3600
      ~ id                      = "terminating" -> (known after apply)
      ~ name                    = "terminating" -> "deregistration" # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      ~ evaluation_periods                    = 3 -> 1
        id                                    = "IdleRunnersTooLow-actions-runner-2024122120350701390000000c-9wY7dU"
        tags                                  = {}
        # (21 unchanged attributes hidden)
    }

  # module.actions-runner.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::303467602807:policy/terraform-20241221203559213900000015"
        name             = "terraform-20241221203559213900000015"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          ~ "autoscaling:SetInstanceHealth" -> "ec2:DescribeInstances",
                            "autoscaling:DescribeAutoScalingInstances",
                        ]
                      ~ Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU" -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "autoscaling:SetInstanceProtection",
                          + "autoscaling:SetInstanceHealth",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU"
                    },
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0f9802e01406e3f46"
      ~ image_id                             = "ami-07fd1c322c2f6269b" -> "ami-000a1bde8afe0c325"
      ~ latest_version                       = 12 -> (known after apply)
        name                                 = "actions-runner-2024122120350701390000000c"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHZGw0ZkFCRUFDc2E1ZnhWWDRWZU1XaEZRakdKQ01JNjF1d1BaWTlUbktKNHYza3IrMDVXSnZlcERxVgogICAgICAgIGpqWUxlSlEycHowVnBQajFvTnpEaWRNUUNxRW1vbzZuNlNtMEJ0eDl2UkNUa29pd3JteGhRM2ptTEwwK0VyeVMKICAgICAgICB5Qy9rakZQN2VhWjgzQXl6cG1VYyt1ZkcvUVN4RjBUYXJnUCtDU2tBNEFZSXMrREJwVkdiT1FJNFpSampsWHN6CiAgICAgICAgcTFMa2Q0NE9oZlk0RUcyaFBwTGNsblJ1YkJFYzB1OWRNRERuNFJidGpydTdscnkzUm9ML1gwTjM5RjA3SVlYOQogICAgICAgIEZ6c1gvYVdkVlcwTkdFRnBsM3ZjSmt3cTBuQ3dZTE1UT2tpNXMrYW1xVVhmeWQrdUNUYzQ0LzBOU0d5OW9iclQKICAgICAgICBHQU95STVzcE9VU2FncG55WTFiK3Y4UVF5VExsMzJsUWt5aWZMQUtneEo0UjJZM1d3UDZLTjljYnlGQXBCeEtHCiAgICAgICAgNFpwdXU5TGpwVVdpeStzb0tGM242T1R1RW1GMUpQaXRNNHV0Z2l3a2l1cTF4SFlMWGsvcEpEMGVOS0xUanJMMgogICAgICAgIDg2VVJYc0prT00vSVpydm82dXZ1MkFMVjhvMm1qbUlyajd2UzArUzZEZ2hGcEZGOU5YVjQrY3lXelJnV2hkQzcKICAgICAgICBCWnluTnRIb2c0M2RRQnNSaXVUWkJDV0lvUWtjUU5FeTVHT24vRHdqSWdJT21aSy9UaW9nNzU5NkFxaDVlS001CiAgICAgICAgU2F0ekJDUVNVenNFYVl4YlEwNU9OMkdxMzBOd1ludHlHdDZNamdjcWNlanprWlBHSzR6WFpSL2p3N1dQQTNHKwogICAgICAgIElQRzlNRTM3Y3BZNGk1Q2ZxcVYzbmpjeXJIY01TSW03aExWZVZxQU5vb1J1NjlXYk1CRjRrQVhuV1FBUkFRQUIKICAgICAgICB0R05KYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRTl5CiAgICAgICAgWVdOMWJHRnlJSEpsY0c5emFYUnZjbmtwSUR4d1lXTnJZV2RsY2kxdmNtRmpkV3hoY2tCcGJtWnlZV2h2ZFhObAogICAgICAgIExtTnZiVDZKQWxjRUV3RUtBRUVXSVFROVJHaUZuZ2JReHU1VVhTTmhjTkRiK3ZicDhnVUNaMlhoOEFJYkF3VUoKICAgICAgICBBOEpuQUFVTENRZ0hBZ0lpQWdZVkNna0lDd0lFRmdJREFRSWVCd0lYZ0FBS0NSQmhjTkRiK3ZicDhtbGVELzBkCiAgICAgICAgdjZDeklqMHJVeW1YUjZoQjVNWWlFSCtBbG1jcEVITyswQ3dvU3lGQzRlN3dkczFJcTBUVW9jTXl6WWxVUjhzQgogICAgICAgIGEreTJLTUd2bE5aQmVuSUtvcjAwNit6ZXdET21aWmJzOEt6YXZHQy9kTDlybU9uSTNiK1lkamFoUC95dm9rcHMKICAgICAgICAwM0kzSHNPRjlJaE9LdjZTbWczZ0QrSzFnRFUxVlFTWGRjZ2l5WDMyZFNaaG45WVJnUzhCcDUxSERNNHZzZmEzCiAgICAgICAgb2hvN0FLT3V5ZWx5V1VpNml5ZTF2L3d3Vjg5dE8rZkhSZzBGZUdBNWc4WnRYRFcyOUNPUDRnZy94OVhiRlVpNgogICAgICAgIEdGeUs2RVlGdm5zZHp2elRWN0pYeHRnMStQa2xveEpWRFJBZm5PUUdCTlh4TGRjM05jaTIwd09Ia2NHZEZJNnMKICAgICAgICBXN0tIMFZhOXh3c1QreHlRQTY1dm0xS1l6R0ordHN5ZTE5M1o0enZpM0pFbklkNFpZVU1aWEM2cTlnZWFLRktsCiAgICAgICAgRGx6dEZWWDUyUENHeGs1MlloSlB3WWNiOEpFRzNweE80eHdtRU9rOVRwTnRsVk1DZVgzZWFGYk5SVDJwWXJYYQogICAgICAgIEREL2ZCT2ZPRis1S3MxM0RBL3pKbnFwSHprbVNuNWdLOFdvR3U3UXUxZnpLNzJMY1RxYi82SnllSW04UlNydUUKICAgICAgICBiems2V0tYalB0eVhyczRWUStkMlhyOHk4Yk5nR3JCWDNUdVlhaVR2L05ka0hlaERvcXZzb0J1czQ4OS9DVVlaCiAgICAgICAgbU52MEt6c3pINWx6UHl2aTlyaURVUVJFZjNpcXhsLzVZMmFhTStWZHhoWGVmN3pJbzhpdDllcnZVMU5qaExzdAogICAgICAgIGh5MG9zbGxuWEg1TnZia1NZSEw3ZEV2N0NYVlhIb0JIUjFhcHJNdzJpYmtDRFFSblplSHdBUkFBMzA4aHRvMzAKICAgICAgICBuTEwwYy83NUU5YlFSTUJFOGFVaDdzd3JiUGo0bWlXeEhsemJXZFRzVjE3UDhEUFhuSlo2ZXE4VlVqcDYyWEh5CiAgICAgICAgS3J4YksvZTVXYWZoTWVuQlhDeWcxZVNkbjduMHI5bmIwRzlOS3hRNU84NlI1cFlaVmhERElIK3pNRnI2Y3BiMwogICAgICAgIEpSOWhsaEhPV3c5bktOU3VhMFRTL2FoS25DUWV3eDJ2MmNseERPaEc5QnN4ZlArT1l5a2tUSEx2QlZGbjh4S0oKICAgICAgICBRclpidGtuUE9BZDBxYUsxampuZ1JpYUpOWHlWWkJEVkFmUFhZYU5yS09ya3FCd1RZakdIR1lHdTNZUXdwNThOCiAgICAgICAgSjM5QjFPeXQ4emM3aFFublFLd1hRZ2ZFaE9uTFpGbDhhSkRBb2pQa0JlcHduc0tQTVo5RnVrQXQ5RHBab1VYdQogICAgICAgIDVtT2QzZFEzZDFKQTRvVXZTS1Z1TWtXWnc0ZXRPbDlDbHplSnhZV3ZsRGM4eFBHc0k5QU9xZmdJYXFDWmpFOXUKICAgICAgICAvb3kzeExEcjkrbjlmNEV5YXpraXhQTWNtL29Pd3RrUmZ4WjlKYU5TVFJ5S1JwZFRPZDJ6T21nNFA5TUVabm5kCiAgICAgICAgNkozSDFENnFmYkVJYUc3SGt2RVc3YzFuTHBXMnhyTjZXWjZreTZGd1ppZDAzajlOMVg3YTV3WkpaaVQ0Z1l1dAogICAgICAgIFN6SXo0UlMyamJrWmd5NGdCV2krc0lmZDliVGtWRzcvNVNCam4wV0E5NWtJS3I1MjVXVlgrS3dtNXFrYU5IZE4KICAgICAgICBnT3FLL3BkS1gzUTNOS1hURG1CV3VPcnRoSEk1TUxHYVBLd3hDVnhaSTI3MGpvVXhQbjJmYUh5emRQNWNiTm9mCiAgICAgICAgZGlVd25XVVVVY0MxVVVlU0gzRVo0YjJQaUFTdmhKNDl0TDhBRVFFQUFZa0NQQVFZQVFvQUpoWWhCRDFFYUlXZQogICAgICAgIEJ0REc3bFJkSTJGdzBOdjY5dW55QlFKblplSHdBaHNNQlFrRHdtY0FBQW9KRUdGdzBOdjY5dW55Y1NBUC8yZ3IKICAgICAgICBFMUdlVXhGNmVyQUxpd2E4c1djQVV5YXlaMTBCa0VxLzVZay9VSUZQODd4WEJTdnJQdERPQnFWbjErVkxFSm9PCiAgICAgICAgM1ZzNEU5SGVmZFUrWmRwTEY5bUkrZy9hZlNwdi9lbFduczdmL3IwK0IzS0RYVE8reExBaS9hUlVVTmZlcVdCTQogICAgICAgIFVscXQ5ZXJGZXJOUUNPNm4zTE02N3NYMkhNQ205TlJXT2J5NXF2dU1sZlhhNG11NERRbjR6c2VoUWw0NENWaFYKICAgICAgICBIMllnWXZ0MzJNcmRFVmZVN2w1dmlWMWtTc1FFRC83ZCs3WTIwMTZYdDN5RWFMbVFITGM1ejRhZjA1Vyt6N3N4CiAgICAgICAgcE5MNk52WXgrd2NQdmxKZ0R3V1lzbzhMZFZ2NEY0ZG9xYURXOTFyMHJXUnd6d0w0bGwvTmJOWG9GRjlTWm0rMwogICAgICAgIENMVXJ5a1NvRHNmUDAzSHh2bWxqMGQwZ2g2TVhwSGVldjk3eXBBNzgxREd1cTg4VkpYUXNZa0JSOUxBWlh4VFoKICAgICAgICB1eDBWd1FTdXJYbUFKaDdrUlppV1U4cURlcXFXNGVNTktKL3BQZVRreE5lSkdHNzNrZlUvQWo5eDg2U2pEazZtCiAgICAgICAgSE40dlBKWmhQcExZL2ROZFhsT0dVMWE0eG53MXYyT2xuRkY0bmp0V2g3SzlSQk4ybUdidjVabDQvTDVMa2RjVgogICAgICAgIEh6cU0rd0VwbEpLamFFd3BQQjIyZDdKZjZtZ004bHF4VWx2TnRSSmlnMEtoeGJkQnpQdTF2K041cTRWR2NKZVgKICAgICAgICBKRHhYd3pUZTRGYXRpcU9jTTBZTmFuTlYvcElVNU1SUlpiYVVlUnM4Z0hxUlc5eGNXVTlZYXh2UllaUklvc0l4CiAgICAgICAgRHpjWHVGMGcxS01sY3hyWTRoanJ1Q0lnazJsMytZWktHODJXRVdhegogICAgICAgID11cGxRCiAgICAgICAgLS0tLS1FTkQgUEdQIFBVQkxJQyBLRVkgQkxPQ0stLS0tLQogICAgICAic291cmNlIjogImRlYiBbc2lnbmVkLWJ5PSRLRVlfRklMRV0gaHR0cHM6Ly9yZWxlYXNlLW9yYWN1bGFyLmluZnJhaG91c2UuY29tLwogICAgICAgICRSRUxFQVNFIG1haW4iCiJwYWNrYWdlX3VwZGF0ZSI6IHRydWUKInBhY2thZ2VzIjoKLSAibWFrZSIKLSAiZ2NjIgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJydWJ5LXJ1YnlnZW1zIgotICJydWJ5LWRldiIKLSAiZGViaGVscGVyIgotICJkZXZzY3JpcHRzIgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgotICJnb2xhbmciCi0gImh1Z28iCi0gIm5vZGVqcyIKLSAibnBtIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInJ1bmNtZCI6Ci0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwganNvbiIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLWNvcmUiCi0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwgYXdzLXNkay1zZWNyZXRzbWFuYWdlciIKLSAiaWgtcHVwcGV0ICAtLWVudmlyb25tZW50IGRldmVsb3BtZW50IC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbAogIC0tbW9kdWxlLXBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlcwogIGFwcGx5IC9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogImV4cG9ydCBBV1NfREVGQVVMVF9SRUdJT049dXMtd2VzdC0xIgogICJwYXRoIjogIi9ldGMvcHJvZmlsZS5kL2F3cy5zaCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6IHwtCiAgICBbZGVmYXVsdF0KICAgIHJlZ2lvbj11cy13ZXN0LTEKICAicGF0aCI6ICIvcm9vdC8uYXdzL2NvbmZpZyIKICAicGVybWlzc2lvbnMiOiAiMDYwMCIKLSAiY29udGVudCI6IHwKICAgICJwdXBwZXRfZW52aXJvbm1lbnQiOiAiZGV2ZWxvcG1lbnQiCiAgICAicHVwcGV0X3JvbGUiOiAiZ2hhX3J1bm5lciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiY2FuY2VsX2luc3RhbmNlX3JlZnJlc2hfb25fZXJyb3JcIjpmYWxzZSxcImRlYnVnXCI6ZmFsc2UsXCJlbnZpcm9ubWVudHBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzXCIsXCJoaWVyYS1jb25maWdcIjpcIi9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbFwiLFwibWFuaWZlc3RcIjpcIi9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJsYWJlbHNcIjpbXCJvcmFjdWxhclwiLFwiaHVnb1wiXSxcInJlZ2lzdHJhdGlvbl90b2tlbl9zZWNyZXRfcHJlZml4XCI6XCJHSC1yZWctdG9rZW4tczVnZ3FIXCJ9IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9jdXN0b20uanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6IHwKICAgIGdsb2JhbCA6IHsKICAgICAgICAgICAgZXh0ZXJuYWwtZGlyIDogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC8iLAogICAgfQogICJwYXRoIjogIi9ldGMvZmFjdGVyL2ZhY3Rlci5jb25mIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHZGw0ZkFCRUFDc2E1ZnhWWDRWZU1XaEZRakdKQ01JNjF1d1BaWTlUbktKNHYza3IrMDVXSnZlcERxVgogICAgICAgIGpqWUxlSlEycHowVnBQajFvTnpEaWRNUUNxRW1vbzZuNlNtMEJ0eDl2UkNUa29pd3JteGhRM2ptTEwwK0VyeVMKICAgICAgICB5Qy9rakZQN2VhWjgzQXl6cG1VYyt1ZkcvUVN4RjBUYXJnUCtDU2tBNEFZSXMrREJwVkdiT1FJNFpSampsWHN6CiAgICAgICAgcTFMa2Q0NE9oZlk0RUcyaFBwTGNsblJ1YkJFYzB1OWRNRERuNFJidGpydTdscnkzUm9ML1gwTjM5RjA3SVlYOQogICAgICAgIEZ6c1gvYVdkVlcwTkdFRnBsM3ZjSmt3cTBuQ3dZTE1UT2tpNXMrYW1xVVhmeWQrdUNUYzQ0LzBOU0d5OW9iclQKICAgICAgICBHQU95STVzcE9VU2FncG55WTFiK3Y4UVF5VExsMzJsUWt5aWZMQUtneEo0UjJZM1d3UDZLTjljYnlGQXBCeEtHCiAgICAgICAgNFpwdXU5TGpwVVdpeStzb0tGM242T1R1RW1GMUpQaXRNNHV0Z2l3a2l1cTF4SFlMWGsvcEpEMGVOS0xUanJMMgogICAgICAgIDg2VVJYc0prT00vSVpydm82dXZ1MkFMVjhvMm1qbUlyajd2UzArUzZEZ2hGcEZGOU5YVjQrY3lXelJnV2hkQzcKICAgICAgICBCWnluTnRIb2c0M2RRQnNSaXVUWkJDV0lvUWtjUU5FeTVHT24vRHdqSWdJT21aSy9UaW9nNzU5NkFxaDVlS001CiAgICAgICAgU2F0ekJDUVNVenNFYVl4YlEwNU9OMkdxMzBOd1ludHlHdDZNamdjcWNlanprWlBHSzR6WFpSL2p3N1dQQTNHKwogICAgICAgIElQRzlNRTM3Y3BZNGk1Q2ZxcVYzbmpjeXJIY01TSW03aExWZVZxQU5vb1J1NjlXYk1CRjRrQVhuV1FBUkFRQUIKICAgICAgICB0R05KYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRTl5CiAgICAgICAgWVdOMWJHRnlJSEpsY0c5emFYUnZjbmtwSUR4d1lXTnJZV2RsY2kxdmNtRmpkV3hoY2tCcGJtWnlZV2h2ZFhObAogICAgICAgIExtTnZiVDZKQWxjRUV3RUtBRUVXSVFROVJHaUZuZ2JReHU1VVhTTmhjTkRiK3ZicDhnVUNaMlhoOEFJYkF3VUoKICAgICAgICBBOEpuQUFVTENRZ0hBZ0lpQWdZVkNna0lDd0lFRmdJREFRSWVCd0lYZ0FBS0NSQmhjTkRiK3ZicDhtbGVELzBkCiAgICAgICAgdjZDeklqMHJVeW1YUjZoQjVNWWlFSCtBbG1jcEVITyswQ3dvU3lGQzRlN3dkczFJcTBUVW9jTXl6WWxVUjhzQgogICAgICAgIGEreTJLTUd2bE5aQmVuSUtvcjAwNit6ZXdET21aWmJzOEt6YXZHQy9kTDlybU9uSTNiK1lkamFoUC95dm9rcHMKICAgICAgICAwM0kzSHNPRjlJaE9LdjZTbWczZ0QrSzFnRFUxVlFTWGRjZ2l5WDMyZFNaaG45WVJnUzhCcDUxSERNNHZzZmEzCiAgICAgICAgb2hvN0FLT3V5ZWx5V1VpNml5ZTF2L3d3Vjg5dE8rZkhSZzBGZUdBNWc4WnRYRFcyOUNPUDRnZy94OVhiRlVpNgogICAgICAgIEdGeUs2RVlGdm5zZHp2elRWN0pYeHRnMStQa2xveEpWRFJBZm5PUUdCTlh4TGRjM05jaTIwd09Ia2NHZEZJNnMKICAgICAgICBXN0tIMFZhOXh3c1QreHlRQTY1dm0xS1l6R0ordHN5ZTE5M1o0enZpM0pFbklkNFpZVU1aWEM2cTlnZWFLRktsCiAgICAgICAgRGx6dEZWWDUyUENHeGs1MlloSlB3WWNiOEpFRzNweE80eHdtRU9rOVRwTnRsVk1DZVgzZWFGYk5SVDJwWXJYYQogICAgICAgIEREL2ZCT2ZPRis1S3MxM0RBL3pKbnFwSHprbVNuNWdLOFdvR3U3UXUxZnpLNzJMY1RxYi82SnllSW04UlNydUUKICAgICAgICBiems2V0tYalB0eVhyczRWUStkMlhyOHk4Yk5nR3JCWDNUdVlhaVR2L05ka0hlaERvcXZzb0J1czQ4OS9DVVlaCiAgICAgICAgbU52MEt6c3pINWx6UHl2aTlyaURVUVJFZjNpcXhsLzVZMmFhTStWZHhoWGVmN3pJbzhpdDllcnZVMU5qaExzdAogICAgICAgIGh5MG9zbGxuWEg1TnZia1NZSEw3ZEV2N0NYVlhIb0JIUjFhcHJNdzJpYmtDRFFSblplSHdBUkFBMzA4aHRvMzAKICAgICAgICBuTEwwYy83NUU5YlFSTUJFOGFVaDdzd3JiUGo0bWlXeEhsemJXZFRzVjE3UDhEUFhuSlo2ZXE4VlVqcDYyWEh5CiAgICAgICAgS3J4YksvZTVXYWZoTWVuQlhDeWcxZVNkbjduMHI5bmIwRzlOS3hRNU84NlI1cFlaVmhERElIK3pNRnI2Y3BiMwogICAgICAgIEpSOWhsaEhPV3c5bktOU3VhMFRTL2FoS25DUWV3eDJ2MmNseERPaEc5QnN4ZlArT1l5a2tUSEx2QlZGbjh4S0oKICAgICAgICBRclpidGtuUE9BZDBxYUsxampuZ1JpYUpOWHlWWkJEVkFmUFhZYU5yS09ya3FCd1RZakdIR1lHdTNZUXdwNThOCiAgICAgICAgSjM5QjFPeXQ4emM3aFFublFLd1hRZ2ZFaE9uTFpGbDhhSkRBb2pQa0JlcHduc0tQTVo5RnVrQXQ5RHBab1VYdQogICAgICAgIDVtT2QzZFEzZDFKQTRvVXZTS1Z1TWtXWnc0ZXRPbDlDbHplSnhZV3ZsRGM4eFBHc0k5QU9xZmdJYXFDWmpFOXUKICAgICAgICAvb3kzeExEcjkrbjlmNEV5YXpraXhQTWNtL29Pd3RrUmZ4WjlKYU5TVFJ5S1JwZFRPZDJ6T21nNFA5TUVabm5kCiAgICAgICAgNkozSDFENnFmYkVJYUc3SGt2RVc3YzFuTHBXMnhyTjZXWjZreTZGd1ppZDAzajlOMVg3YTV3WkpaaVQ0Z1l1dAogICAgICAgIFN6SXo0UlMyamJrWmd5NGdCV2krc0lmZDliVGtWRzcvNVNCam4wV0E5NWtJS3I1MjVXVlgrS3dtNXFrYU5IZE4KICAgICAgICBnT3FLL3BkS1gzUTNOS1hURG1CV3VPcnRoSEk1TUxHYVBLd3hDVnhaSTI3MGpvVXhQbjJmYUh5emRQNWNiTm9mCiAgICAgICAgZGlVd25XVVVVY0MxVVVlU0gzRVo0YjJQaUFTdmhKNDl0TDhBRVFFQUFZa0NQQVFZQVFvQUpoWWhCRDFFYUlXZQogICAgICAgIEJ0REc3bFJkSTJGdzBOdjY5dW55QlFKblplSHdBaHNNQlFrRHdtY0FBQW9KRUdGdzBOdjY5dW55Y1NBUC8yZ3IKICAgICAgICBFMUdlVXhGNmVyQUxpd2E4c1djQVV5YXlaMTBCa0VxLzVZay9VSUZQODd4WEJTdnJQdERPQnFWbjErVkxFSm9PCiAgICAgICAgM1ZzNEU5SGVmZFUrWmRwTEY5bUkrZy9hZlNwdi9lbFduczdmL3IwK0IzS0RYVE8reExBaS9hUlVVTmZlcVdCTQogICAgICAgIFVscXQ5ZXJGZXJOUUNPNm4zTE02N3NYMkhNQ205TlJXT2J5NXF2dU1sZlhhNG11NERRbjR6c2VoUWw0NENWaFYKICAgICAgICBIMllnWXZ0MzJNcmRFVmZVN2w1dmlWMWtTc1FFRC83ZCs3WTIwMTZYdDN5RWFMbVFITGM1ejRhZjA1Vyt6N3N4CiAgICAgICAgcE5MNk52WXgrd2NQdmxKZ0R3V1lzbzhMZFZ2NEY0ZG9xYURXOTFyMHJXUnd6d0w0bGwvTmJOWG9GRjlTWm0rMwogICAgICAgIENMVXJ5a1NvRHNmUDAzSHh2bWxqMGQwZ2g2TVhwSGVldjk3eXBBNzgxREd1cTg4VkpYUXNZa0JSOUxBWlh4VFoKICAgICAgICB1eDBWd1FTdXJYbUFKaDdrUlppV1U4cURlcXFXNGVNTktKL3BQZVRreE5lSkdHNzNrZlUvQWo5eDg2U2pEazZtCiAgICAgICAgSE40dlBKWmhQcExZL2ROZFhsT0dVMWE0eG53MXYyT2xuRkY0bmp0V2g3SzlSQk4ybUdidjVabDQvTDVMa2RjVgogICAgICAgIEh6cU0rd0VwbEpLamFFd3BQQjIyZDdKZjZtZ004bHF4VWx2TnRSSmlnMEtoeGJkQnpQdTF2K041cTRWR2NKZVgKICAgICAgICBKRHhYd3pUZTRGYXRpcU9jTTBZTmFuTlYvcElVNU1SUlpiYVVlUnM4Z0hxUlc5eGNXVTlZYXh2UllaUklvc0l4CiAgICAgICAgRHpjWHVGMGcxS01sY3hyWTRoanJ1Q0lnazJsMytZWktHODJXRVdhegogICAgICAgID11cGxRCiAgICAgICAgLS0tLS1FTkQgUEdQIFBVQkxJQyBLRVkgQkxPQ0stLS0tLQogICAgICAic291cmNlIjogImRlYiBbc2lnbmVkLWJ5PSRLRVlfRklMRV0gaHR0cHM6Ly9yZWxlYXNlLW9yYWN1bGFyLmluZnJhaG91c2UuY29tLwogICAgICAgICRSRUxFQVNFIG1haW4iCiJwYWNrYWdlX3VwZGF0ZSI6IHRydWUKInBhY2thZ2VzIjoKLSAibWFrZSIKLSAiZ2NjIgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJydWJ5LXJ1YnlnZW1zIgotICJydWJ5LWRldiIKLSAiZGViaGVscGVyIgotICJkZXZzY3JpcHRzIgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgotICJnb2xhbmciCi0gImh1Z28iCi0gIm5vZGVqcyIKLSAibnBtIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInJ1bmNtZCI6Ci0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwganNvbiIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLWNvcmUiCi0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwgYXdzLXNkay1zZWNyZXRzbWFuYWdlciIKLSAiaWgtcHVwcGV0ICAtLWVudmlyb25tZW50IGRldmVsb3BtZW50IC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbAogIC0tbW9kdWxlLXBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlcwogIGFwcGx5IC9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwIgotICJpaC1hd3MgLS12ZXJib3NlIGF1dG9zY2FsaW5nIGNvbXBsZXRlIGJvb3RzdHJhcCIKIndyaXRlX2ZpbGVzIjoKLSAiY29udGVudCI6ICJleHBvcnQgQVdTX0RFRkFVTFRfUkVHSU9OPXVzLXdlc3QtMSIKICAicGF0aCI6ICIvZXRjL3Byb2ZpbGUuZC9hd3Muc2giCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogImRldmVsb3BtZW50IgogICAgInB1cHBldF9yb2xlIjogImdoYV9ydW5uZXIiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImloLXB1cHBldFwiOntcImNhbmNlbF9pbnN0YW5jZV9yZWZyZXNoX29uX2Vycm9yXCI6ZmFsc2UsXCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L2hpZXJhLnlhbWxcIixcIm1hbmlmZXN0XCI6XCIvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9tYW5pZmVzdHMvc2l0ZS5wcFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzL3tlbnZpcm9ubWVudH0vbW9kdWxlczp7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXNcIixcInJvb3QtZGlyZWN0b3J5XCI6XCIvb3B0L3B1cHBldC1jb2RlXCJ9fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvaWgtcHVwcGV0Lmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiYm9vdHN0cmFwX2hvb2tuYW1lXCI6XCJib290c3RyYXBcIixcImxhYmVsc1wiOltcIm9yYWN1bGFyXCIsXCJodWdvXCJdLFwicmVnaXN0cmF0aW9uX3Rva2VuX3NlY3JldF9wcmVmaXhcIjpcIkdILXJlZy10b2tlbi1zNWdncUhcIn0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfAogICAgZ2xvYmFsIDogewogICAgICAgICAgICBleHRlcm5hbC1kaXIgOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kLyIsCiAgICB9CiAgInBhdGgiOiAiL2V0Yy9mYWN0ZXIvZmFjdGVyLmNvbmYiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
userdata changes:
--- before
+++ after
@@ -91,6 +91,7 @@
   --root-directory /opt/puppet-code --hiera-config /opt/infrahouse-puppet-data/environments/development/hiera.yaml
   --module-path {root_directory}/environments/{environment}/modules:{root_directory}/modules
   apply /opt/puppet-code/environments/development/manifests/site.pp"
+- "ih-aws --verbose autoscaling complete bootstrap"
 "write_files":
 - "content": "export AWS_DEFAULT_REGION=us-west-1"
   "path": "/etc/profile.d/aws.sh"
@@ -108,7 +109,7 @@
 - "content": "{\"ih-puppet\":{\"cancel_instance_refresh_on_error\":false,\"debug\":false,\"environmentpath\":\"{root_directory}/environments\",\"hiera-config\":\"/opt/infrahouse-puppet-data/environments/development/hiera.yaml\",\"manifest\":\"/opt/puppet-code/environments/development/manifests/site.pp\",\"module-path\":\"{root_directory}/environments/{environment}/modules:{root_directory}/modules\",\"root-directory\":\"/opt/puppet-code\"}}"
   "path": "/etc/puppetlabs/facter/facts.d/ih-puppet.json"
   "permissions": "0644"
-- "content": "{\"labels\":[\"oracular\",\"hugo\"],\"registration_token_secret_prefix\":\"GH-reg-token-s5ggqH\"}"
+- "content": "{\"bootstrap_hookname\":\"bootstrap\",\"labels\":[\"oracular\",\"hugo\"],\"registration_token_secret_prefix\":\"GH-reg-token-s5ggqH\"}"
   "path": "/etc/puppetlabs/facter/facts.d/custom.json"
   "permissions": "0644"
 - "content": |
EOF userdata changes.
        # (15 unchanged attributes hidden)

      ~ block_device_mappings {
            # (3 unchanged attributes hidden)

          ~ ebs {
              + encrypted             = "true"
                # (7 unchanged attributes hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner must be replaced
-/+ resource "aws_autoscaling_group" "actions-runner" {
      ~ arn                              = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:61960432-d131-410a-af87-9e86572e6b3e:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5" -> (known after apply)
      ~ availability_zones               = [
          - "us-west-1b",
          - "us-west-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 1 -> (known after apply)
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "actions-runner-20250324032323830500000002-sdnQE5" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
        name                             = "actions-runner-20250324032323830500000002-sdnQE5"
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::303467602807:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ availability_zone_distribution (known after apply)
      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      - initial_lifecycle_hook { # forces replacement
          - default_result          = "ABANDON" -> null
          - heartbeat_timeout       = 300 -> null
          - lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING" -> null
          - name                    = "launching" -> null
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook { # forces replacement
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "registration"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook { # forces replacement
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 3600
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "bootstrap"
            # (3 unchanged attributes hidden)
        }

      ~ instance_refresh {
          - triggers = [] -> null
            # (1 unchanged attribute hidden)

          ~ preferences {
              - auto_rollback                = false -> null
              - checkpoint_percentages       = [] -> null
                # (7 unchanged attributes hidden)
            }
        }

      ~ launch_template (known after apply)

      ~ mixed_instances_policy {
          ~ instances_distribution {
              ~ on_demand_allocation_strategy            = "prioritized" -> (known after apply)
              ~ spot_allocation_strategy                 = "lowest-price" -> (known after apply)
              ~ spot_instance_pools                      = 2 -> (known after apply)
                # (3 unchanged attributes hidden)
            }
          ~ launch_template {
              ~ launch_template_specification {
                  ~ launch_template_name = "actions-runner-20250324032323830500000002" -> (known after apply)
                  ~ version              = "4" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
              ~ override (known after apply)
            }
        }

      ~ traffic_source (known after apply)

      + warm_pool {
          + max_group_prepared_capacity = 2
          + min_size                    = 2
          + pool_state                  = "Hibernated"

          + instance_reuse_policy {
              + reuse_on_scale_in = true
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating must be replaced
-/+ resource "aws_autoscaling_lifecycle_hook" "terminating" {
      ~ heartbeat_timeout       = 300 -> 3600
      ~ id                      = "terminating" -> (known after apply)
      ~ name                    = "terminating" -> "deregistration" # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      ~ evaluation_periods                    = 3 -> 1
        id                                    = "IdleRunnersTooLow-actions-runner-20250324032323830500000002-sdnQE5"
        tags                                  = {}
        # (21 unchanged attributes hidden)
    }

  # module.actions-runner-noble.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::303467602807:policy/terraform-2025032403240580660000000b"
        name             = "terraform-2025032403240580660000000b"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          ~ "autoscaling:SetInstanceHealth" -> "ec2:DescribeInstances",
                            "autoscaling:DescribeAutoScalingInstances",
                        ]
                      ~ Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:61960432-d131-410a-af87-9e86572e6b3e:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5" -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "autoscaling:SetInstanceProtection",
                          + "autoscaling:SetInstanceHealth",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5"
                    },
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-01feafb8075d6a58c"
      ~ image_id                             = "ami-0d3274c4129454aa7" -> "ami-0f852f6b9cdfac2a8"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "actions-runner-20250324032323830500000002"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHYWI1RVVCRUFDeGVBOHpvQkVZWXF6cDljQmpYb3VEWlAyeXVmN0RTUFNFenhjYjZuVitLaUlwNkwzcgogICAgICAgIG5PVE9uaTAxZHBON1JFdXAwbHArekdDRU5XRDBpTlJySGdPMG5rTmF1RFNCMzRrOGdpdVhMdzVzUytzeXFyOHUKICAgICAgICBJdDBsbW1xeW1kTXFtbXAxRER2REhtYlJ2YS9MY0daZlhwV1Nvdk53d0wrR3hHemFxbnluSmIvMmxLOVEyRnU0CiAgICAgICAgNERMRkMvVnlkM2ZTa0dmUm1pcHJoSmM5OGV4ODRGK3UxRGNJWE91QnNFRWZ5bGtKNFROcmFyMDNHTTFoWFJWOQogICAgICAgIDhXUTdCQ2loTkhZOWp2MzBpLzlPRGhSZkh0ZGdKbWNCVEhBdWRKK1cxWDIyNXFIblViYjE2MnJGSVJDb0JaL2UKICAgICAgICAwOHl5NUFnd2d2OHY2Z3dMZm11cGFIanFYSC9DUmhHV0p0eVhidjAyTHRNVVlSaEFqZ2VmV3NZTy9heHlIVStiCiAgICAgICAgVmhHSkdqSll6SU5VMWg2UFYxcnV4cWd3RW13cWZ3dmlxaEJmbHZ6WUdlRGNQT2hUekRNR0Yzb2JNckg2a1dSNAogICAgICAgIEI1aHVvZ0M5dVR6MzkxcWl2Tml1NFVDL0I3elpwWlRSeDNpbkljUjdrYytYcDdhcG1aWmVWZXg3K3hiNE9qNW0KICAgICAgICAxMkpKQzRrcVFqOFEwSFpYK0tWbkJjaUN6eHJOeit2bFExcUcvU2NYejFlM3dQM05iMUVqR0YrVFVhUGtPM3ZMCiAgICAgICAgSVM1Z0JXQ0p4ODgzY2w2WWtZWE9BVTZ1dzlIWTNZcFNMc3RBcEREZ3hJNmp1MHA4UkUrSE9MRkp5RkxPd0pmTQogICAgICAgIGNucmZMU05JUXVYZHBFajNhZlVOc2hiNDVPUlhaTGlXVURrMDdaZGlyOWkrL0pFNFNPRnBSdWxBVHdBUkFRQUIKICAgICAgICB0RjFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRzV2CiAgICAgICAgWW14bElISmxjRzl6YVhSdmNua3BJRHh3WVdOcllXZGxjaTF1YjJKc1pVQnBibVp5WVdodmRYTmxMbU52YlQ2SgogICAgICAgIEFsY0VFd0VJQUVFV0lRU21KN2QyQUJrTHBSdVFORlBUZWhnYmFKcldHUVVDWnB2a1JRSWJBd1VKQThKbkFBVUwKICAgICAgICBDUWdIQWdJaUFnWVZDZ2tJQ3dJRUZnSURBUUllQndJWGdBQUtDUkRUZWhnYmFKcldHVGpzRC85VE5PeGVLZFQ2CiAgICAgICAgNXQvQjBRd2tsK3hyL1NWWm1hVTUvTmJFd1hXdjQwbzMrOXN4UkdBU25RMDl6RTZicEdkektkcUVWUEZlb3VGSwogICAgICAgIFllRHRIVE9LMjArc2l1YkhwMnY0VDBCRHhNMk5HR3Q5cndERmx2L0pDbmY3aXJiVHdyU3FjbzlYck02U3R0NGQKICAgICAgICA4dmlZZXYyclNYSGZ5REdudkduWjM1TFVtSHlHRmx5ekdQVTlNZXI3VnNrWE5EOGUyQkZ4ajduR1RMYlZkNzZMCiAgICAgICAgS0JQOWRFWVJiMTRGTFpxS3Z4cXFiZkp0bFhJNmdnZDdNdVVsbjBpWTBOcWtZVUN0TnZQK0dpbk5tY3Vla21CcwogICAgICAgIFpzbkRPS0JFRFdhMHBEOWJ6bktGNmZWQ2h3aUc2aWFjSDVuWnRlVFE5Uk5tTVpoUStFKzBQTWtpSnlhNnU5UDUKICAgICAgICAreFAwaU05ODRvY2d6S0NMWTFmc0pMUTdGZG54MGdRVkt0S1o5YnBBeS9BWC9uMlZ0cTFLUmNQUHVrbFFUYk92CiAgICAgICAgRHhBajczbWxKL2hSZUVXWDlDL004bE1MZ01EQU1EUUdObC9XVEN1UlB5d1N6MXZ3RHVYMVNLaTBOSno5ZTc2RAogICAgICAgIHFJR1IzSkhVSTBjUHJDODluWW1FdUg0UEtqcytZRGRoa1ZNeGZIVlc2azFzTWNiclJFdm9SdzJjcWZiajk2Sk8KICAgICAgICBKU0VBWEVrdGRIbmJDa1FJd0pUQTM2M20rOVhVSzQ5a29jNWlnc09ORzQrN0hvb3QrZWxQMDZXZ2VsS1BzV3ZqCiAgICAgICAgaUNVWG1vL3ppaGhQYTRVNytYbEJYdURjRFROUmtUc1VzNDJ2eXRnSXBpWkFHTDNPekk1UXpiWjRTcWV3TDVzUAogICAgICAgIHFCdGdOTWp5SVhjNmhCbE9WUGJaYWRvVlczdk5MK2tlK2JrQ0RRUm1tK1JGQVJBQXV0cVFLbzlub08yMHIyci8KICAgICAgICBTWmZHQjluMjFPSitoaHhXZ2laaFNGVTRFNnhmSmowVHIxTWJiZ0ppeXhFSUVSZHBjRzNMRWtTQnhMaXF3RitqCiAgICAgICAgYzFlSHRERHpRbDk2OEFLTGN4a2pJcUZYVjF6V2hTRTFTVFV6WllyTHh0SkwwWDYwdnlOZXJHY3JJYng2dFR4SwogICAgICAgIDIvVEhBQmVab1hqTENhNGVZY1A1cVhYU2s4aVJuNGkxRUJTM2hITjR1Q0RIcHRFNVBsOTNqV0ptdXdvRWtZVHgKICAgICAgICBoeTVSN3haR0FLUHU0eXNmRG1nSVU4eVhlWThDYndDY2Exa2NvVnlNWjRERUdJd2gxSklJNmwzWEEzVldyY29FCiAgICAgICAgNUE4MTRBa2Z2aW80VTlBMjZFNCthR2cvUWdtdm9BNU9wdFo2YW8zV24vT0lON3NueEdnYXdDU3RPZVdyWFI5eQogICAgICAgIGZKYThIWVhKRGEvVG9FdHkwT1R4Z2lFeFFXWVBUYU82QWQvYzZjYWJJUnFnM1h2QzJsbGg4Rkc1V052UCs0bS8KICAgICAgICBGeTN5MnBEanljMndFTExCWlZvTDcwOUZkdFBGNGFqUTVrQ3k3ZlVKMi9zcUpEa1RYdGEzcWI0UnBURm9kSmRCCiAgICAgICAgMHd0Z0tmbXdqRTUvb2pBWUFFZ0lCVm54RXcvczR6MURjOWtxcFA0UDRVRUJxdjhaWHBCcHV6cGN0WDNESVlBeQogICAgICAgIG9PVTdYZTFDSWFIZGhQN2xicnlkb0pUeHJvd1I3WXowdHpvdGhqV2ZGQXFMMW9lOVhEcnl3YjMwKzlDVzRmQy8KICAgICAgICBvcTE4Z3phcUVBT0w4V3lGNHYzQkdzSHVGWjM0YVB0ZnJHczVNZUNvS3FnOHd6bi9mdklkMHk2dldxYXRQZmNzCiAgICAgICAgWXNuM0RDOTdiNThLMjhVUXlwcDlIWTlvYUtrQUVRRUFBWWtDUEFRWUFRZ0FKaFloQktZbnQzWUFHUXVsRzVBMAogICAgICAgIFU5TjZHQnRvbXRZWkJRSm1tK1JGQWhzTUJRa0R3bWNBQUFvSkVOTjZHQnRvbXRZWmpUOFAvMXJPYzk3S2syZkwKICAgICAgICBkZ1VZUDY2TVErNTFIMWlGaDRlalkzbzBqeEsza0NURThJaHJQZVZOSW9pTFpvaFFnUHJwRHBROWFRVDJnalNhCiAgICAgICAgWVBBVTl6QmwrV2lzaFFuckZmenZWVGNPNVBWMHhoVEtXdEJ0WmR6RnYwV2NJUnRtOWdPWVc1R2hCbTBPZjVCRQogICAgICAgIDZRb3hHODRuQW1mNWVVZGd4eFFxUG5XVkZUbnh4dyszM0Nudk9CMFpZTDJlb2o2U0V5bWEydFlyV0xMdGtUTnEKICAgICAgICA1TmdTUDB3R1c0U0ZuMEFhL0VpM01GUktGVXFpRnphZXkrdnJXa2hqMFZsNXNweGYxSzZ5ZGppbG1lNXlWc2JuCiAgICAgICAgZ0Z5bGROOTdUOFdyYzRtSGhNUTMvVjE5RHk3SkcrdEVhQjZXREErRnp4K3EyajF4OExwVG5HNWhZSjhYTzlNbwogICAgICAgIDdKUnFQMHN0a1B3anp1bWNPV1pkREZtNG9aODBPekZPOEpkaVBIVi9qS1llVlVrNDUySENLVGU4WElCT2RIbWMKICAgICAgICBwdVlBanRXaVErZzlpMlU4UzJRaGxvb2NtWXRJeDR5UnhnWTlxemMxN0tGREdsL3ZhanlpM1hkeUN1ZURLc3A3CiAgICAgICAgUXZqc2dkbU5tRnVkMjh3dXY4aEltUlRQMlBsMnJnMTdEM0tjaW1RUm4rR0ZCamlTbDVNZHd5dHk5Y2pYWE1lagogICAgICAgIDVRNVVEY1pFOVViVGp4OGJ0TkxlbnhlTXV3WEV4NjBDKzlRU3NZUEFiWHhWVVFRUXRSakpoekp2MHhqcVZ4dDAKICAgICAgICA4NWZKVjE3VXp6Y21ZdnlOS1hPd2VOdkNweFd2L0RZSk5GOTQrb29ZL3JvT0o0VDJzMjQwS0VOck04aDZOVGV4CiAgICAgICAgaGQvMmp1eERQY1JnNlNzUms0dEpXRkZwa0FTclB4OFAKICAgICAgICA9WmhpRQogICAgICAgIC0tLS0tRU5EIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KICAgICAgInNvdXJjZSI6ICJkZWIgW3NpZ25lZC1ieT0kS0VZX0ZJTEVdIGh0dHBzOi8vcmVsZWFzZS1ub2JsZS5pbmZyYWhvdXNlLmNvbS8gJFJFTEVBU0UKICAgICAgICBtYWluIgoicGFja2FnZV91cGRhdGUiOiB0cnVlCiJwYWNrYWdlcyI6Ci0gIm1ha2UiCi0gImdjYyIKLSAicHVwcGV0LWNvZGUiCi0gImluZnJhaG91c2UtdG9vbGtpdCIKLSAicnVieS1ydWJ5Z2VtcyIKLSAicnVieS1kZXYiCi0gImRlYmhlbHBlciIKLSAiZGV2c2NyaXB0cyIKLSAiaW5mcmFob3VzZS1wdXBwZXQtZGF0YSIKLSAiZ29sYW5nIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInB1cHBldCI6CiAgImNvbGxlY3Rpb24iOiAicHVwcGV0OCIKICAiaW5zdGFsbCI6IHRydWUKICAiaW5zdGFsbF90eXBlIjogImFpbyIKICAicGFja2FnZV9uYW1lIjogInB1cHBldC1hZ2VudCIKICAic3RhcnRfc2VydmljZSI6IGZhbHNlCiAgInZlcnNpb24iOiAiOC4xMC4wIgoicnVuY21kIjoKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBqc29uIgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGF3cy1zZGstY29yZSIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgZGV2ZWxvcG1lbnQgLS1lbnZpcm9ubWVudHBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMKICAtLXJvb3QtZGlyZWN0b3J5IC9vcHQvcHVwcGV0LWNvZGUgLS1oaWVyYS1jb25maWcgL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzCiAgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHAiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJkZXZlbG9wbWVudCIKICAgICJwdXBwZXRfcm9sZSI6ICJnaGFfcnVubmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJjYW5jZWxfaW5zdGFuY2VfcmVmcmVzaF9vbl9lcnJvclwiOmZhbHNlLFwiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sXCIsXCJtYW5pZmVzdFwiOlwiL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHBcIixcIm1vZHVsZS1wYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImxhYmVsc1wiOltcIm5vYmxlXCJdLFwicmVnaXN0cmF0aW9uX3Rva2VuX3NlY3JldF9wcmVmaXhcIjpcIkdILXJlZy10b2tlbi1XdmZzWldcIn0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHYWI1RVVCRUFDeGVBOHpvQkVZWXF6cDljQmpYb3VEWlAyeXVmN0RTUFNFenhjYjZuVitLaUlwNkwzcgogICAgICAgIG5PVE9uaTAxZHBON1JFdXAwbHArekdDRU5XRDBpTlJySGdPMG5rTmF1RFNCMzRrOGdpdVhMdzVzUytzeXFyOHUKICAgICAgICBJdDBsbW1xeW1kTXFtbXAxRER2REhtYlJ2YS9MY0daZlhwV1Nvdk53d0wrR3hHemFxbnluSmIvMmxLOVEyRnU0CiAgICAgICAgNERMRkMvVnlkM2ZTa0dmUm1pcHJoSmM5OGV4ODRGK3UxRGNJWE91QnNFRWZ5bGtKNFROcmFyMDNHTTFoWFJWOQogICAgICAgIDhXUTdCQ2loTkhZOWp2MzBpLzlPRGhSZkh0ZGdKbWNCVEhBdWRKK1cxWDIyNXFIblViYjE2MnJGSVJDb0JaL2UKICAgICAgICAwOHl5NUFnd2d2OHY2Z3dMZm11cGFIanFYSC9DUmhHV0p0eVhidjAyTHRNVVlSaEFqZ2VmV3NZTy9heHlIVStiCiAgICAgICAgVmhHSkdqSll6SU5VMWg2UFYxcnV4cWd3RW13cWZ3dmlxaEJmbHZ6WUdlRGNQT2hUekRNR0Yzb2JNckg2a1dSNAogICAgICAgIEI1aHVvZ0M5dVR6MzkxcWl2Tml1NFVDL0I3elpwWlRSeDNpbkljUjdrYytYcDdhcG1aWmVWZXg3K3hiNE9qNW0KICAgICAgICAxMkpKQzRrcVFqOFEwSFpYK0tWbkJjaUN6eHJOeit2bFExcUcvU2NYejFlM3dQM05iMUVqR0YrVFVhUGtPM3ZMCiAgICAgICAgSVM1Z0JXQ0p4ODgzY2w2WWtZWE9BVTZ1dzlIWTNZcFNMc3RBcEREZ3hJNmp1MHA4UkUrSE9MRkp5RkxPd0pmTQogICAgICAgIGNucmZMU05JUXVYZHBFajNhZlVOc2hiNDVPUlhaTGlXVURrMDdaZGlyOWkrL0pFNFNPRnBSdWxBVHdBUkFRQUIKICAgICAgICB0RjFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRzV2CiAgICAgICAgWW14bElISmxjRzl6YVhSdmNua3BJRHh3WVdOcllXZGxjaTF1YjJKc1pVQnBibVp5WVdodmRYTmxMbU52YlQ2SgogICAgICAgIEFsY0VFd0VJQUVFV0lRU21KN2QyQUJrTHBSdVFORlBUZWhnYmFKcldHUVVDWnB2a1JRSWJBd1VKQThKbkFBVUwKICAgICAgICBDUWdIQWdJaUFnWVZDZ2tJQ3dJRUZnSURBUUllQndJWGdBQUtDUkRUZWhnYmFKcldHVGpzRC85VE5PeGVLZFQ2CiAgICAgICAgNXQvQjBRd2tsK3hyL1NWWm1hVTUvTmJFd1hXdjQwbzMrOXN4UkdBU25RMDl6RTZicEdkektkcUVWUEZlb3VGSwogICAgICAgIFllRHRIVE9LMjArc2l1YkhwMnY0VDBCRHhNMk5HR3Q5cndERmx2L0pDbmY3aXJiVHdyU3FjbzlYck02U3R0NGQKICAgICAgICA4dmlZZXYyclNYSGZ5REdudkduWjM1TFVtSHlHRmx5ekdQVTlNZXI3VnNrWE5EOGUyQkZ4ajduR1RMYlZkNzZMCiAgICAgICAgS0JQOWRFWVJiMTRGTFpxS3Z4cXFiZkp0bFhJNmdnZDdNdVVsbjBpWTBOcWtZVUN0TnZQK0dpbk5tY3Vla21CcwogICAgICAgIFpzbkRPS0JFRFdhMHBEOWJ6bktGNmZWQ2h3aUc2aWFjSDVuWnRlVFE5Uk5tTVpoUStFKzBQTWtpSnlhNnU5UDUKICAgICAgICAreFAwaU05ODRvY2d6S0NMWTFmc0pMUTdGZG54MGdRVkt0S1o5YnBBeS9BWC9uMlZ0cTFLUmNQUHVrbFFUYk92CiAgICAgICAgRHhBajczbWxKL2hSZUVXWDlDL004bE1MZ01EQU1EUUdObC9XVEN1UlB5d1N6MXZ3RHVYMVNLaTBOSno5ZTc2RAogICAgICAgIHFJR1IzSkhVSTBjUHJDODluWW1FdUg0UEtqcytZRGRoa1ZNeGZIVlc2azFzTWNiclJFdm9SdzJjcWZiajk2Sk8KICAgICAgICBKU0VBWEVrdGRIbmJDa1FJd0pUQTM2M20rOVhVSzQ5a29jNWlnc09ORzQrN0hvb3QrZWxQMDZXZ2VsS1BzV3ZqCiAgICAgICAgaUNVWG1vL3ppaGhQYTRVNytYbEJYdURjRFROUmtUc1VzNDJ2eXRnSXBpWkFHTDNPekk1UXpiWjRTcWV3TDVzUAogICAgICAgIHFCdGdOTWp5SVhjNmhCbE9WUGJaYWRvVlczdk5MK2tlK2JrQ0RRUm1tK1JGQVJBQXV0cVFLbzlub08yMHIyci8KICAgICAgICBTWmZHQjluMjFPSitoaHhXZ2laaFNGVTRFNnhmSmowVHIxTWJiZ0ppeXhFSUVSZHBjRzNMRWtTQnhMaXF3RitqCiAgICAgICAgYzFlSHRERHpRbDk2OEFLTGN4a2pJcUZYVjF6V2hTRTFTVFV6WllyTHh0SkwwWDYwdnlOZXJHY3JJYng2dFR4SwogICAgICAgIDIvVEhBQmVab1hqTENhNGVZY1A1cVhYU2s4aVJuNGkxRUJTM2hITjR1Q0RIcHRFNVBsOTNqV0ptdXdvRWtZVHgKICAgICAgICBoeTVSN3haR0FLUHU0eXNmRG1nSVU4eVhlWThDYndDY2Exa2NvVnlNWjRERUdJd2gxSklJNmwzWEEzVldyY29FCiAgICAgICAgNUE4MTRBa2Z2aW80VTlBMjZFNCthR2cvUWdtdm9BNU9wdFo2YW8zV24vT0lON3NueEdnYXdDU3RPZVdyWFI5eQogICAgICAgIGZKYThIWVhKRGEvVG9FdHkwT1R4Z2lFeFFXWVBUYU82QWQvYzZjYWJJUnFnM1h2QzJsbGg4Rkc1V052UCs0bS8KICAgICAgICBGeTN5MnBEanljMndFTExCWlZvTDcwOUZkdFBGNGFqUTVrQ3k3ZlVKMi9zcUpEa1RYdGEzcWI0UnBURm9kSmRCCiAgICAgICAgMHd0Z0tmbXdqRTUvb2pBWUFFZ0lCVm54RXcvczR6MURjOWtxcFA0UDRVRUJxdjhaWHBCcHV6cGN0WDNESVlBeQogICAgICAgIG9PVTdYZTFDSWFIZGhQN2xicnlkb0pUeHJvd1I3WXowdHpvdGhqV2ZGQXFMMW9lOVhEcnl3YjMwKzlDVzRmQy8KICAgICAgICBvcTE4Z3phcUVBT0w4V3lGNHYzQkdzSHVGWjM0YVB0ZnJHczVNZUNvS3FnOHd6bi9mdklkMHk2dldxYXRQZmNzCiAgICAgICAgWXNuM0RDOTdiNThLMjhVUXlwcDlIWTlvYUtrQUVRRUFBWWtDUEFRWUFRZ0FKaFloQktZbnQzWUFHUXVsRzVBMAogICAgICAgIFU5TjZHQnRvbXRZWkJRSm1tK1JGQWhzTUJRa0R3bWNBQUFvSkVOTjZHQnRvbXRZWmpUOFAvMXJPYzk3S2syZkwKICAgICAgICBkZ1VZUDY2TVErNTFIMWlGaDRlalkzbzBqeEsza0NURThJaHJQZVZOSW9pTFpvaFFnUHJwRHBROWFRVDJnalNhCiAgICAgICAgWVBBVTl6QmwrV2lzaFFuckZmenZWVGNPNVBWMHhoVEtXdEJ0WmR6RnYwV2NJUnRtOWdPWVc1R2hCbTBPZjVCRQogICAgICAgIDZRb3hHODRuQW1mNWVVZGd4eFFxUG5XVkZUbnh4dyszM0Nudk9CMFpZTDJlb2o2U0V5bWEydFlyV0xMdGtUTnEKICAgICAgICA1TmdTUDB3R1c0U0ZuMEFhL0VpM01GUktGVXFpRnphZXkrdnJXa2hqMFZsNXNweGYxSzZ5ZGppbG1lNXlWc2JuCiAgICAgICAgZ0Z5bGROOTdUOFdyYzRtSGhNUTMvVjE5RHk3SkcrdEVhQjZXREErRnp4K3EyajF4OExwVG5HNWhZSjhYTzlNbwogICAgICAgIDdKUnFQMHN0a1B3anp1bWNPV1pkREZtNG9aODBPekZPOEpkaVBIVi9qS1llVlVrNDUySENLVGU4WElCT2RIbWMKICAgICAgICBwdVlBanRXaVErZzlpMlU4UzJRaGxvb2NtWXRJeDR5UnhnWTlxemMxN0tGREdsL3ZhanlpM1hkeUN1ZURLc3A3CiAgICAgICAgUXZqc2dkbU5tRnVkMjh3dXY4aEltUlRQMlBsMnJnMTdEM0tjaW1RUm4rR0ZCamlTbDVNZHd5dHk5Y2pYWE1lagogICAgICAgIDVRNVVEY1pFOVViVGp4OGJ0TkxlbnhlTXV3WEV4NjBDKzlRU3NZUEFiWHhWVVFRUXRSakpoekp2MHhqcVZ4dDAKICAgICAgICA4NWZKVjE3VXp6Y21ZdnlOS1hPd2VOdkNweFd2L0RZSk5GOTQrb29ZL3JvT0o0VDJzMjQwS0VOck04aDZOVGV4CiAgICAgICAgaGQvMmp1eERQY1JnNlNzUms0dEpXRkZwa0FTclB4OFAKICAgICAgICA9WmhpRQogICAgICAgIC0tLS0tRU5EIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KICAgICAgInNvdXJjZSI6ICJkZWIgW3NpZ25lZC1ieT0kS0VZX0ZJTEVdIGh0dHBzOi8vcmVsZWFzZS1ub2JsZS5pbmZyYWhvdXNlLmNvbS8gJFJFTEVBU0UKICAgICAgICBtYWluIgoicGFja2FnZV91cGRhdGUiOiB0cnVlCiJwYWNrYWdlcyI6Ci0gIm1ha2UiCi0gImdjYyIKLSAicHVwcGV0LWNvZGUiCi0gImluZnJhaG91c2UtdG9vbGtpdCIKLSAicnVieS1ydWJ5Z2VtcyIKLSAicnVieS1kZXYiCi0gImRlYmhlbHBlciIKLSAiZGV2c2NyaXB0cyIKLSAiaW5mcmFob3VzZS1wdXBwZXQtZGF0YSIKLSAiZ29sYW5nIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInB1cHBldCI6CiAgImNvbGxlY3Rpb24iOiAicHVwcGV0OCIKICAiaW5zdGFsbCI6IHRydWUKICAiaW5zdGFsbF90eXBlIjogImFpbyIKICAicGFja2FnZV9uYW1lIjogInB1cHBldC1hZ2VudCIKICAic3RhcnRfc2VydmljZSI6IGZhbHNlCiAgInZlcnNpb24iOiAiOC4xMC4wIgoicnVuY21kIjoKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBqc29uIgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGF3cy1zZGstY29yZSIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgZGV2ZWxvcG1lbnQgLS1lbnZpcm9ubWVudHBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMKICAtLXJvb3QtZGlyZWN0b3J5IC9vcHQvcHVwcGV0LWNvZGUgLS1oaWVyYS1jb25maWcgL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzCiAgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHAiCi0gImloLWF3cyAtLXZlcmJvc2UgYXV0b3NjYWxpbmcgY29tcGxldGUgYm9vdHN0cmFwIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogImV4cG9ydCBBV1NfREVGQVVMVF9SRUdJT049dXMtd2VzdC0xIgogICJwYXRoIjogIi9ldGMvcHJvZmlsZS5kL2F3cy5zaCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6IHwtCiAgICBbZGVmYXVsdF0KICAgIHJlZ2lvbj11cy13ZXN0LTEKICAicGF0aCI6ICIvcm9vdC8uYXdzL2NvbmZpZyIKICAicGVybWlzc2lvbnMiOiAiMDYwMCIKLSAiY29udGVudCI6IHwKICAgICJwdXBwZXRfZW52aXJvbm1lbnQiOiAiZGV2ZWxvcG1lbnQiCiAgICAicHVwcGV0X3JvbGUiOiAiZ2hhX3J1bm5lciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiY2FuY2VsX2luc3RhbmNlX3JlZnJlc2hfb25fZXJyb3JcIjpmYWxzZSxcImRlYnVnXCI6ZmFsc2UsXCJlbnZpcm9ubWVudHBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzXCIsXCJoaWVyYS1jb25maWdcIjpcIi9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbFwiLFwibWFuaWZlc3RcIjpcIi9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJib290c3RyYXBfaG9va25hbWVcIjpcImJvb3RzdHJhcFwiLFwibGFiZWxzXCI6W1wibm9ibGVcIl0sXCJyZWdpc3RyYXRpb25fdG9rZW5fc2VjcmV0X3ByZWZpeFwiOlwiR0gtcmVnLXRva2VuLVd2ZnNaV1wifSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
userdata changes:
--- before
+++ after
@@ -95,6 +95,7 @@
   --root-directory /opt/puppet-code --hiera-config /opt/infrahouse-puppet-data/environments/development/hiera.yaml
   --module-path {root_directory}/environments/{environment}/modules:{root_directory}/modules
   apply /opt/puppet-code/environments/development/manifests/site.pp"
+- "ih-aws --verbose autoscaling complete bootstrap"
 "write_files":
 - "content": "export AWS_DEFAULT_REGION=us-west-1"
   "path": "/etc/profile.d/aws.sh"
@@ -112,7 +113,7 @@
 - "content": "{\"ih-puppet\":{\"cancel_instance_refresh_on_error\":false,\"debug\":false,\"environmentpath\":\"{root_directory}/environments\",\"hiera-config\":\"/opt/infrahouse-puppet-data/environments/development/hiera.yaml\",\"manifest\":\"/opt/puppet-code/environments/development/manifests/site.pp\",\"module-path\":\"{root_directory}/environments/{environment}/modules:{root_directory}/modules\",\"root-directory\":\"/opt/puppet-code\"}}"
   "path": "/etc/puppetlabs/facter/facts.d/ih-puppet.json"
   "permissions": "0644"
-- "content": "{\"labels\":[\"noble\"],\"registration_token_secret_prefix\":\"GH-reg-token-WvfsZW\"}"
+- "content": "{\"bootstrap_hookname\":\"bootstrap\",\"labels\":[\"noble\"],\"registration_token_secret_prefix\":\"GH-reg-token-WvfsZW\"}"
   "path": "/etc/puppetlabs/facter/facts.d/custom.json"
   "permissions": "0644"
 
EOF userdata changes.
        # (15 unchanged attributes hidden)

      ~ block_device_mappings {
            # (3 unchanged attributes hidden)

          ~ ebs {
              + encrypted             = "true"
                # (7 unchanged attributes hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.deregistration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda actions-runner-2024122120350701390000000c-9wY7dU_deregistration every 5 minutes"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = "actions-runner-20241221203507013900000"
      + schedule_expression = "rate(5 minutes)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/actions-runner-2024122120350701390000000c-9wY7dU_deregistration"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.deregistration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda actions-runner-2024122120350701390000000c-9wY7dU_deregistration"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sts:GetCallerIdentity",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "autoscaling:DescribeWarmPool",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  + {
                      + Action   = "secretsmanager:DeleteSecret"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.deregistration.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "actions-runner-2024122120350701390000000c-9wY7dU_deregistration"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-action-runner-lambda-20250501125715090400000001"
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"                         = "actions-runner-2024122120350701390000000c-9wY7dU"
              + "GH_APP_ID"                        = "1016363"
              + "GITHUB_ORG_NAME"                  = "infrahouse"
              + "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE"               = "pem"
              + "HOOK_NAME"                        = "deregistration"
              + "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-s5ggqH"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "actions-runner-2024122120350701390000000c-9wY7dU_deregistration"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.deregistration.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "actions-runner-2024122120350701390000000c-9wY7dU_deregistration"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250501125715090400000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner.module.deregistration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744"
          + "main_version"         = "0ca4a122c64f37b43518510e62641af2"
        }
    }

  # module.actions-runner.module.deregistration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "0ca4a122c64f37b43518510e62641af2"
          + "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744"
        }
      + result  = (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::303467602807:policy/actions-runner-sbn5RaTtAltb20241221203559214000000016"
        name             = "actions-runner-sbn5RaTtAltb20241221203559214000000016"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          ~ "autoscaling:SetInstanceHealth" -> "ec2:DescribeInstances",
                            "autoscaling:DescribeAutoScalingInstances",
                        ]
                      ~ Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU" -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "autoscaling:SetInstanceProtection",
                          + "autoscaling:SetInstanceHealth",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU"
                    },
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every must be replaced
-/+ resource "aws_cloudwatch_event_rule" "run_every" {
      ~ arn                 = "arn:aws:events:us-west-1:303467602807:rule/run-every-minute" -> (known after apply)
      ~ id                  = "run-every-minute" -> (known after apply)
      - is_enabled          = true -> null
      ~ name                = "run-every-minute" -> (known after apply)
      + name_prefix         = "actions-runner-20241221203507013900000" # forces replacement
      - state               = "ENABLED" -> null
      ~ tags                = {
            "account"           = "303467602807"
          ~ "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5" -> "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all            = {
          ~ "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5" -> "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target must be replaced
-/+ resource "aws_cloudwatch_event_target" "lambda_target" {
      ~ id             = "run-every-minute-send-to-lambda" -> (known after apply)
      ~ rule           = "run-every-minute" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda must be replaced
-/+ resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::303467602807:role/iam_for_lambda20250501125742352600000008" -> (known after apply)
      ~ create_date           = "2025-05-01T12:57:42Z" -> (known after apply)
      ~ id                    = "iam_for_lambda20250501125742352600000008" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::303467602807:policy/lambda_logging2025050112580019970000000f",
          - "arn:aws:iam::303467602807:policy/lambda_permissions20250501125742114700000007",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "iam_for_lambda20250501125742352600000008" -> (known after apply)
      ~ name_prefix           = "iam_for_lambda" -> "infrahouse-registration" # forces replacement
        tags                  = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ unique_id             = "AROAUNKAUEN3TX5DNJ7XY" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      ~ id         = "iam_for_lambda20250501125742352600000008-2025050112574304970000000c" -> (known after apply)
      ~ role       = "iam_for_lambda20250501125742352600000008" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_logs" {
      ~ id         = "iam_for_lambda20250501125742352600000008-20250501125800765700000010" -> (known after apply)
      ~ role       = "iam_for_lambda20250501125742352600000008" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      ~ id         = "iam_for_lambda20250501125742352600000008-2025050112574300270000000b" -> (known after apply)
      ~ role       = "iam_for_lambda20250501125742352600000008" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "record_metric_actions-runner-2024122120350701390000000c-9wY7dU"
      ~ role                           = "arn:aws:iam::303467602807:role/iam_for_lambda20250501125742352600000008" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge must be replaced
-/+ resource "aws_lambda_permission" "allow_eventbridge" {
      ~ id                  = "AllowExecutionFromEventBridge" -> (known after apply)
      ~ source_arn          = "arn:aws:events:us-west-1:303467602807:rule/run-every-minute" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale must be replaced
-/+ resource "aws_cloudwatch_event_rule" "scale" {
      ~ arn                 = "arn:aws:events:us-west-1:303467602807:rule/asg-scale2024122120351288730000000e" -> (known after apply)
      ~ event_pattern       = jsonencode(
          ~ {
              ~ detail-type = [
                  - "EC2 Instance-terminate Lifecycle Action",
                    "EC2 Instance-launch Lifecycle Action",
                ]
                # (2 unchanged attributes hidden)
            }
        )
      ~ id                  = "asg-scale2024122120351288730000000e" -> (known after apply)
      - is_enabled          = true -> null
      ~ name                = "asg-scale2024122120351288730000000e" -> (known after apply)
      ~ name_prefix         = "asg-scale" -> "actions-runner-20241221203507013900000" # forces replacement
      - state               = "ENABLED" -> null
        tags                = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_target.scale-in-out must be replaced
-/+ resource "aws_cloudwatch_event_target" "scale-in-out" {
      ~ id             = "asg-scale2024122120351288730000000e-terraform-20241221203520806800000012" -> (known after apply)
      ~ rule           = "asg-scale2024122120351288730000000e" -> (known after apply) # forces replacement
      ~ target_id      = "terraform-20241221203520806800000012" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions2024122120351289410000000f"
        name             = "lambda_permissions2024122120351289410000000f"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  ~ {
                      ~ Action   = [
                            "secretsmanager:PutSecretValue",
                          + "secretsmanager:DescribeSecret",
                            "secretsmanager:DeleteSecret",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-2024122120350701390000000c-9wY7dU_registration"
      ~ last_modified                  = "2025-05-01T12:57:35.000+0000" -> (known after apply)
      ~ s3_key                         = "4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      ~ id                  = "terraform-20241221203520800700000011" -> (known after apply)
      ~ source_arn          = "arn:aws:events:us-west-1:303467602807:rule/asg-scale2024122120351288730000000e" -> (known after apply) # forces replacement
      ~ statement_id        = "terraform-20241221203520800700000011" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250501125715090400000001/4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "6f14763fa9710b4130e83cec7302743d-5" -> (known after apply)
      ~ id                            = "4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd.zip" -> (known after apply)
      ~ key                           = "4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_registration/4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "2516075385993166114" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6bf9b5a0ed9a768f2cf1109fae118248" -> "d2d150575969dfe5ad34d9383f06a744"
          ~ "main_version"         = "9c76e8d78e0ee296f1b904854a207898" -> "95d3cdd170c6143cae4d84604cb4c6e9"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "9c76e8d78e0ee296f1b904854a207898" -> "95d3cdd170c6143cae4d84604cb4c6e9"
          ~ "requirements.txt" = "6bf9b5a0ed9a768f2cf1109fae118248" -> "d2d150575969dfe5ad34d9383f06a744"
        }
      ~ result  = "4e6bcad1-5d1d-01e7-b0e1-8b1744cd7ffd" -> (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.deregistration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda actions-runner-20250324032323830500000002-sdnQE5_deregistration every 5 minutes"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = "actions-runner-20250324032323830500000"
      + schedule_expression = "rate(5 minutes)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/actions-runner-20250324032323830500000002-sdnQE5_deregistration"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda actions-runner-20250324032323830500000002-sdnQE5_deregistration"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sts:GetCallerIdentity",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "autoscaling:DescribeWarmPool",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  + {
                      + Action   = "secretsmanager:DeleteSecret"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "actions-runner-20250324032323830500000002-sdnQE5_deregistration"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-action-runner-lambda-20250501125715129700000002"
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"                         = "actions-runner-20250324032323830500000002-sdnQE5"
              + "GH_APP_ID"                        = "1016363"
              + "GITHUB_ORG_NAME"                  = "infrahouse"
              + "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE"               = "pem"
              + "HOOK_NAME"                        = "deregistration"
              + "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-WvfsZW"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "actions-runner-20250324032323830500000002-sdnQE5_deregistration"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "actions-runner-20250324032323830500000002-sdnQE5_deregistration"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250501125715129700000002"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744"
          + "main_version"         = "0ca4a122c64f37b43518510e62641af2"
        }
    }

  # module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "0ca4a122c64f37b43518510e62641af2"
          + "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744"
        }
      + result  = (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::303467602807:policy/actions-runner-LVO4bVFWUIxY2025032403240580680000000c"
        name             = "actions-runner-LVO4bVFWUIxY2025032403240580680000000c"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          ~ "autoscaling:SetInstanceHealth" -> "ec2:DescribeInstances",
                            "autoscaling:DescribeAutoScalingInstances",
                        ]
                      ~ Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:61960432-d131-410a-af87-9e86572e6b3e:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5" -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "autoscaling:SetInstanceProtection",
                          + "autoscaling:SetInstanceHealth",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5"
                    },
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every must be replaced
-/+ resource "aws_cloudwatch_event_rule" "run_every" {
      ~ arn                 = "arn:aws:events:us-west-1:303467602807:rule/run-every-minute" -> (known after apply)
      ~ description         = "Trigger Lambda record_metric_actions-runner-2024122120350701390000000c-9wY7dU every minute" -> "Trigger Lambda record_metric_actions-runner-20250324032323830500000002-sdnQE5 every minute"
      ~ id                  = "run-every-minute" -> (known after apply)
      - is_enabled          = true -> null
      ~ name                = "run-every-minute" -> (known after apply)
      + name_prefix         = "actions-runner-20250324032323830500000" # forces replacement
      - state               = "ENABLED" -> null
        tags                = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (5 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target must be replaced
-/+ resource "aws_cloudwatch_event_target" "lambda_target" {
      ~ arn            = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-2024122120350701390000000c-9wY7dU" -> "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      ~ id             = "run-every-minute-send-to-lambda" -> (known after apply)
      ~ rule           = "run-every-minute" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda must be replaced
-/+ resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::303467602807:role/iam_for_lambda20250501125742086400000005" -> (known after apply)
      ~ create_date           = "2025-05-01T12:57:42Z" -> (known after apply)
      ~ id                    = "iam_for_lambda20250501125742086400000005" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::303467602807:policy/lambda_logging2025050112575544050000000d",
          - "arn:aws:iam::303467602807:policy/lambda_permissions20250501125742087900000006",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "iam_for_lambda20250501125742086400000005" -> (known after apply)
      ~ name_prefix           = "iam_for_lambda" -> "infrahouse-registration" # forces replacement
        tags                  = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ unique_id             = "AROAUNKAUEN34BPEZVJY7" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      ~ id         = "iam_for_lambda20250501125742086400000005-2025050112574273280000000a" -> (known after apply)
      ~ role       = "iam_for_lambda20250501125742086400000005" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_logs" {
      ~ id         = "iam_for_lambda20250501125742086400000005-2025050112575604310000000e" -> (known after apply)
      ~ role       = "iam_for_lambda20250501125742086400000005" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      ~ id         = "iam_for_lambda20250501125742086400000005-20250501125742726600000009" -> (known after apply)
      ~ role       = "iam_for_lambda20250501125742086400000005" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      ~ role                           = "arn:aws:iam::303467602807:role/iam_for_lambda20250501125742086400000005" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge must be replaced
-/+ resource "aws_lambda_permission" "allow_eventbridge" {
      ~ id                  = "AllowExecutionFromEventBridge" -> (known after apply)
      ~ source_arn          = "arn:aws:events:us-west-1:303467602807:rule/run-every-minute" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale must be replaced
-/+ resource "aws_cloudwatch_event_rule" "scale" {
      ~ arn                 = "arn:aws:events:us-west-1:303467602807:rule/asg-scale20250324032330006500000004" -> (known after apply)
      ~ event_pattern       = jsonencode(
          ~ {
              ~ detail-type = [
                  - "EC2 Instance-terminate Lifecycle Action",
                    "EC2 Instance-launch Lifecycle Action",
                ]
                # (2 unchanged attributes hidden)
            }
        )
      ~ id                  = "asg-scale20250324032330006500000004" -> (known after apply)
      - is_enabled          = true -> null
      ~ name                = "asg-scale20250324032330006500000004" -> (known after apply)
      ~ name_prefix         = "asg-scale" -> "actions-runner-20250324032323830500000" # forces replacement
      - state               = "ENABLED" -> null
        tags                = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out must be replaced
-/+ resource "aws_cloudwatch_event_target" "scale-in-out" {
      ~ id             = "asg-scale20250324032330006500000004-terraform-20250324032338135400000007" -> (known after apply)
      ~ rule           = "asg-scale20250324032330006500000004" -> (known after apply) # forces replacement
      ~ target_id      = "terraform-20250324032338135400000007" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions20250324032330013400000005"
        name             = "lambda_permissions20250324032330013400000005"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  ~ {
                      ~ Action   = [
                            "secretsmanager:PutSecretValue",
                          + "secretsmanager:DescribeSecret",
                            "secretsmanager:DeleteSecret",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250324032323830500000002-sdnQE5_registration"
      ~ last_modified                  = "2025-05-01T12:57:35.000+0000" -> (known after apply)
      ~ s3_key                         = "883f3cfe-3ca0-223d-626d-ab4f02195102.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      ~ id                  = "terraform-20250324032338138100000008" -> (known after apply)
      ~ source_arn          = "arn:aws:events:us-west-1:303467602807:rule/asg-scale20250324032330006500000004" -> (known after apply) # forces replacement
      ~ statement_id        = "terraform-20250324032338138100000008" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250501125715129700000002/883f3cfe-3ca0-223d-626d-ab4f02195102.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "40d344b6bbf6ab28edcbb2d1499869e6-5" -> (known after apply)
      ~ id                            = "883f3cfe-3ca0-223d-626d-ab4f02195102.zip" -> (known after apply)
      ~ key                           = "883f3cfe-3ca0-223d-626d-ab4f02195102.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_registration/883f3cfe-3ca0-223d-626d-ab4f02195102.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5659114446244003138" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6bf9b5a0ed9a768f2cf1109fae118248" -> "d2d150575969dfe5ad34d9383f06a744"
          ~ "main_version"         = "9c76e8d78e0ee296f1b904854a207898" -> "95d3cdd170c6143cae4d84604cb4c6e9"
        }
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "883f3cfe-3ca0-223d-626d-ab4f02195102" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "9c76e8d78e0ee296f1b904854a207898" -> "95d3cdd170c6143cae4d84604cb4c6e9"
          ~ "requirements.txt" = "6bf9b5a0ed9a768f2cf1109fae118248" -> "d2d150575969dfe5ad34d9383f06a744"
        }
      ~ result  = "883f3cfe-3ca0-223d-626d-ab4f02195102" -> (known after apply)
    }

Plan: 60 to add, 14 to change, 30 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDYwLCAiY2hhbmdlIjogMTQsICJkZXN0cm95IjogMzB9fQ==
```
</details>